// Використайте функцію ParseInt з радіусом
// Функція parseInt() аналізує рядок і повертає ціле число. Для радікса потрібен другий аргумент, який визначає основу числа у рядку. Радіксом може бути ціле число від 2 до 36.

// Виклик функції виглядає так:

// parseInt(string, radix);
// Ось приклад:

// const a = parseInt("11", 2);
// Змінна радікса говорить, що 11 знаходиться у двійковій системі або у базі 2. Цей приклад перетворює рядок 11 на ціле число 3.

// Використовуйте parseInt() у функції convertToInteger, щоб воно перетворило двійкове число на ціле число і повернуло його.

function convertToInteger(str) {
  return parseInt(str, 2);
}

convertToInteger("10011");
