// Генерація випадкових дробів з JavaScript
// Випадкові числа є корисними для створення випадкової поведінки об'єкта.

// JavaScript має функцію Math.random(), що генерує випадкові десяткові числа між 0(включно) and 1(виключно).
// Таким чином Math.random() може повернути 0 але ніколи не поверне 1.

// Примітка: Як Storing Values with the Assignment Operator, всі виклики функцій будуть вирішені до того,
//     як return виконується, тому ми можемо повернути значення return функції Math.random().

// Змініть randomFraction, щоб повернути випадкове число замість повернення 0.

function randomFraction() {
  // Змініть код лише під цим рядком

  return Math.random();

  // Змініть код лише над цим рядком
}
