// Генерація випадкових цілих чисел за допомогою JavaScript
// Це чудово, що ми можемо згенерувати випадкові десяткові числа, але більш зручно,
//     якщо ми використаємо їх для генерації випадкових цілих чисел.

// Використовуйте Math.random() щоб згенерувати випадкове десяткове число.
// Помножте це випадкое десяткове на 20.
// Використайте іншу функцію, Math.floor() щоб заокруглити число до найближчого цілого числа.
//     Пам'ятайте, що Math.random() ніколи не повертає 1, тому що ми заокруглюємо без можливості отримати 20.
// Цей метод видасть нам ціле число від 0 до 19.

// Зіставивши усе разом, ось так виглядає наш код:

// Math.floor(Math.random() * 20);
// Ми називаємо Math.random(), перемноживши результат на 20, а потім передаємо значення функції Math.floor() для заокруглення значення до найближчого цілого числа.

// Використайте цей метод для утворення та повернення випадкового цілого числа від 0 до 9.

function randomWholeNum() {
  // Змініть код лише під цим рядком
  // return Math.floor(Math.random() * 10);
  return Math.random();
  //
}
console.log(randomWholeNum());
